import React from 'react';
import Link from "react-router-dom/es/Link";

import faq from '../images/faq.svg'

const  container =  [
    {
        question:'Պե՞տք է ունենալ նախնական գիտելիքներ որևէ դասընթացին մասնակցելու համար',
        answer: 'Ծրագրավորման դասընթացներին մասնակցելու համար անհրաժեշտ է հանձնել ընդունելության համար նախատեսված տրամաբանական և մաթեմատիկական բնույթի թեստ, քանի որ ծրագրավորման մեջ կարևոր նախապայման է ալգորիթմիկ մտածողությունը։'
    },
    {
        question:'Հնարավոր է լրիվ 0-ից սովորել Ձեզ մոտ',
        answer: 'Այո, քանի որ նաև առկա են սկսնակների համար նախատեսված դասընթացներ։'
    },
    {
        question:'Ես ծրագրավորումից ընդհանրապես ոչինչ չեմ հասկանում, ինձ մոտ մի բան կստացվի՞',
        answer: 'Մեծ ցանկության դեպքում ամեն ինչ հնարավոր է 😉, սակայն ցանկալի արդյունքին հասնելու համար հարկավոր է օրական կտրվածքով բավականաչափ ժամանակ տրամադրել տնային առաջադրանքների կատարման և նյութերի ուսումնասիրման համար։'
    },
    {
        question:'Դասընթացի ավարտից հետո հավաստագիր տրամադրու՞մ եք',
        answer: 'Մասնագիտական ուղղվածության որևէ դասընթացի ամբողջական ավարտից հետո տրամադրոմ ենք հավաստագիր՝ համապատասխան որակավորմամբ։'
    },
    {
        question:'Ձեզ մոտ սովորելուց հետո կարո՞ղ եմ ընդունվել աշխատանքի',
        answer: 'Դասընթացի ծրագիրը մշակված է՝ համապատասխան ՏՏ  ոլորտի աշխտաշուկայի պահանջների։ Դասընթացի ավարտից հետո կկարողանաք որպես Junior ծրագրավորող անցնել աշխատանքի։'
    },
    {
        question:'Դուք համակարգիչներ տրամադրու՞մ եք',
        answer: 'Լսարանները հագեցված են համակարգիչներով, սակայն ցանկության դեպքում դասընթացին կարող եք մասնակցել ձեր անձնական նոթբուքով։'
    }
];

const Faq = () => {
    return (
        <section className="background" id="faq-background">
            <h1><img src={faq} alt="FAQ"/>Հաճախ տրվող հարցեր</h1>
            <section id="faq">
                    {
                        container.map((value,index) => {
                            return (
                                <article key={index}>
                                    <h1>{value.question}</h1>
                                    <p>{value.answer}</p>
                                </article>
                            )
                        })
                    }
            </section>
            <h1>Չգտա՞ր քեզ հետաքրքրող հարցը</h1>
            <p>Գրիր մեզ <a href="mailto:basic@it-center.am">basic@it-center.am</a> հասցեով, կամ <Link to="/contacts">Հետադարձ կապ</Link> էջով</p>
        </section>
    )
};

export default Faq